results/freebsd/cached_mid.txt
Running 1m test @ http://192.168.122.142:3000/cached
  8 threads and 200 connections
  Thread calibration: mean lat.: 0.768ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.759ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.778ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.768ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.770ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.763ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.776ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   777.96us  374.86us   6.52ms   64.77%
    Req/Sec   664.78     93.62     1.11k    71.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  766.00us
 75.000%    1.06ms
 90.000%    1.25ms
 99.000%    1.67ms
 99.900%    2.10ms
 99.990%    3.52ms
 99.999%    4.12ms
100.000%    6.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.032     0.000000            1         1.00
       0.281     0.100000        25099         1.11
       0.420     0.200000        49895         1.25
       0.543     0.300000        75020         1.43
       0.655     0.400000        99916         1.67
       0.766     0.500000       124804         2.00
       0.824     0.550000       137314         2.22
       0.883     0.600000       149632         2.50
       0.942     0.650000       162090         2.86
       1.000     0.700000       174720         3.33
       1.057     0.750000       187160         4.00
       1.086     0.775000       193479         4.44
       1.113     0.800000       199584         5.00
       1.143     0.825000       205906         5.71
       1.174     0.850000       212067         6.67
       1.209     0.875000       218218         8.00
       1.229     0.887500       221432         8.89
       1.251     0.900000       224542        10.00
       1.277     0.912500       227627        11.43
       1.305     0.925000       230698        13.33
       1.340     0.937500       233803        16.00
       1.360     0.943750       235359        17.78
       1.383     0.950000       236963        20.00
       1.408     0.956250       238475        22.86
       1.436     0.962500       240028        26.67
       1.468     0.968750       241585        32.00
       1.486     0.971875       242365        35.56
       1.506     0.975000       243170        40.00
       1.529     0.978125       243917        45.71
       1.555     0.981250       244697        53.33
       1.585     0.984375       245500        64.00
       1.603     0.985938       245876        71.11
       1.624     0.987500       246260        80.00
       1.648     0.989062       246646        91.43
       1.680     0.990625       247041       106.67
       1.713     0.992188       247421       128.00
       1.735     0.992969       247620       142.22
       1.760     0.993750       247814       160.00
       1.787     0.994531       248012       182.86
       1.817     0.995313       248204       213.33
       1.858     0.996094       248395       256.00
       1.877     0.996484       248493       284.44
       1.901     0.996875       248592       320.00
       1.927     0.997266       248689       365.71
       1.948     0.997656       248791       426.67
       1.977     0.998047       248884       512.00
       1.990     0.998242       248931       568.89
       2.011     0.998437       248980       640.00
       2.029     0.998633       249028       731.43
       2.057     0.998828       249083       853.33
       2.105     0.999023       249126      1024.00
       2.145     0.999121       249149      1137.78
       2.201     0.999219       249175      1280.00
       2.281     0.999316       249199      1462.86
       2.391     0.999414       249222      1706.67
       2.511     0.999512       249247      2048.00
       2.555     0.999561       249259      2275.56
       2.625     0.999609       249272      2560.00
       2.695     0.999658       249283      2925.71
       2.797     0.999707       249295      3413.33
       2.989     0.999756       249308      4096.00
       3.041     0.999780       249314      4551.11
       3.267     0.999805       249321      5120.00
       3.379     0.999829       249326      5851.43
       3.437     0.999854       249332      6826.67
       3.487     0.999878       249338      8192.00
       3.505     0.999890       249341      9102.22
       3.539     0.999902       249345     10240.00
       3.601     0.999915       249347     11702.86
       3.653     0.999927       249350     13653.33
       3.711     0.999939       249353     16384.00
       3.745     0.999945       249355     18204.44
       3.783     0.999951       249356     20480.00
       3.815     0.999957       249358     23405.71
       3.819     0.999963       249359     27306.67
       3.919     0.999969       249361     32768.00
       3.987     0.999973       249362     36408.89
       3.987     0.999976       249362     40960.00
       4.069     0.999979       249363     46811.43
       4.077     0.999982       249364     54613.33
       4.103     0.999985       249365     65536.00
       4.103     0.999986       249365     72817.78
       4.103     0.999988       249365     81920.00
       4.119     0.999989       249366     93622.86
       4.119     0.999991       249366    109226.67
       4.155     0.999992       249367    131072.00
       4.155     0.999993       249367    145635.56
       4.155     0.999994       249367    163840.00
       4.155     0.999995       249367    187245.71
       4.155     0.999995       249367    218453.33
       6.527     0.999996       249368    262144.00
       6.527     1.000000       249368          inf
#[Mean    =        0.778, StdDeviation   =        0.375]
#[Max     =        6.524, Total count    =       249368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299794 requests in 1.00m, 40.03MB read
Requests/sec:   4996.45
Transfer/sec:    683.11KB