results/freebsd/compute_high.txt
Running 1m test @ http://192.168.122.142:3000/compute
  8 threads and 500 connections
  Thread calibration: mean lat.: 0.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.863ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.861ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.857ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.858ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.209ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.859ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.860ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms  509.10us  21.39ms   73.46%
    Req/Sec     1.30k     0.89k    6.89k    87.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.87ms
 75.000%    1.17ms
 90.000%    1.47ms
 99.000%    2.05ms
 99.900%    5.44ms
 99.990%    8.86ms
 99.999%   20.72ms
100.000%   21.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.039     0.000000            1         1.00
       0.312     0.100000        49825         1.11
       0.475     0.200000        99672         1.25
       0.616     0.300000       149197         1.43
       0.747     0.400000       198898         1.67
       0.871     0.500000       248805         2.00
       0.931     0.550000       273339         2.22
       0.991     0.600000       298192         2.50
       1.051     0.650000       323296         2.86
       1.111     0.700000       347958         3.33
       1.174     0.750000       372806         4.00
       1.208     0.775000       385439         4.44
       1.245     0.800000       397805         5.00
       1.287     0.825000       410008         5.71
       1.338     0.850000       422474         6.67
       1.397     0.875000       434841         8.00
       1.432     0.887500       441100         8.89
       1.469     0.900000       447286        10.00
       1.511     0.912500       453538        11.43
       1.557     0.925000       459672        13.33
       1.608     0.937500       465879        16.00
       1.637     0.943750       468965        17.78
       1.669     0.950000       472136        20.00
       1.703     0.956250       475187        22.86
       1.743     0.962500       478324        26.67
       1.786     0.968750       481385        32.00
       1.812     0.971875       482971        35.56
       1.840     0.975000       484545        40.00
       1.870     0.978125       486056        45.71
       1.905     0.981250       487603        53.33
       1.944     0.984375       489158        64.00
       1.968     0.985938       489950        71.11
       1.995     0.987500       490713        80.00
       2.026     0.989062       491483        91.43
       2.063     0.990625       492281       106.67
       2.113     0.992188       493037       128.00
       2.141     0.992969       493421       142.22
       2.183     0.993750       493815       160.00
       2.239     0.994531       494198       182.86
       2.319     0.995313       494590       213.33
       2.495     0.996094       494974       256.00
       2.683     0.996484       495167       284.44
       2.925     0.996875       495363       320.00
       3.181     0.997266       495554       365.71
       3.519     0.997656       495750       426.67
       3.865     0.998047       495942       512.00
       4.095     0.998242       496040       568.89
       4.379     0.998437       496137       640.00
       4.695     0.998633       496234       731.43
       4.963     0.998828       496333       853.33
       5.503     0.999023       496428      1024.00
       5.671     0.999121       496476      1137.78
       5.831     0.999219       496525      1280.00
       5.951     0.999316       496575      1462.86
       6.155     0.999414       496622      1706.67
       6.411     0.999512       496670      2048.00
       6.623     0.999561       496694      2275.56
       6.855     0.999609       496718      2560.00
       7.135     0.999658       496743      2925.71
       7.291     0.999707       496767      3413.33
       7.503     0.999756       496791      4096.00
       7.675     0.999780       496803      4551.11
       7.879     0.999805       496815      5120.00
       8.199     0.999829       496828      5851.43
       8.431     0.999854       496840      6826.67
       8.607     0.999878       496852      8192.00
       8.759     0.999890       496858      9102.22
       8.975     0.999902       496864     10240.00
       9.071     0.999915       496870     11702.86
       9.271     0.999927       496876     13653.33
       9.535     0.999939       496882     16384.00
       9.671     0.999945       496885     18204.44
       9.999     0.999951       496888     20480.00
      11.079     0.999957       496891     23405.71
      11.319     0.999963       496894     27306.67
      20.495     0.999969       496897     32768.00
      20.511     0.999973       496902     36408.89
      20.511     0.999976       496902     40960.00
      20.511     0.999979       496902     46811.43
      20.559     0.999982       496903     54613.33
      20.719     0.999985       496907     65536.00
      20.719     0.999986       496907     72817.78
      20.719     0.999988       496907     81920.00
      20.719     0.999989       496907     93622.86
      20.751     0.999991       496908    109226.67
      20.783     0.999992       496910    131072.00
      20.783     0.999993       496910    145635.56
      20.783     0.999994       496910    163840.00
      20.783     0.999995       496910    187245.71
      20.783     0.999995       496910    218453.33
      20.943     0.999996       496911    262144.00
      20.943     0.999997       496911    291271.11
      20.943     0.999997       496911    327680.00
      20.943     0.999997       496911    374491.43
      20.943     0.999998       496911    436906.67
      21.407     0.999998       496912    524288.00
      21.407     1.000000       496912          inf
#[Mean    =        0.896, StdDeviation   =        0.509]
#[Max     =       21.392, Total count    =       496912]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  597669 requests in 1.00m, 72.96MB read
Requests/sec:   9956.98
Transfer/sec:      1.22MB